app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("title", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hoge"], ["memo", "hogehoge"], ["created_at", "2019-12-23 14:22:52.488199"], ["updated_at", "2019-12-23 14:22:52.488199"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find(params[:id])